In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 1.데이터 불러오기

### 1.1 서울 공유 자전거(케글)

#### 1.1.1 데이터 불러오기

In [5]:
df_kaggle = pd.read_csv('../data/SeoulBikeData.csv', encoding='cp949')
df_kaggle

,Date,Rented Bike Count,Hour,Temperature(캜),Humidity(%),Wind speed (m/s),Visibility (10m),Dew point temperature(캜),Solar Radiation (MJ/m2),Rainfall(mm),Snowfall (cm),Seasons,Holiday,Functioning Day
0,01/12/2017,254,0,-5.2,37,2.2,2000,-17.6,0.0,0.0,0.0,Winter,No Holiday,Yes
1,01/12/2017,204,1,-5.5,38,0.8,2000,-17.6,0.0,0.0,0.0,Winter,No Holiday,Yes
2,01/12/2017,173,2,-6.0,39,1.0,2000,-17.7,0.0,0.0,0.0,Winter,No Holiday,Yes
3,01/12/2017,107,3,-6.2,40,0.9,2000,-17.6,0.0,0.0,0.0,Winter,No Holiday,Yes
4,01/12/2017,78,4,-6.0,36,2.3,2000,-18.6,0.0,0.0,0.0,Winter,No Holiday,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8755,30/11/2018,1003,19,4.2,34,2.6,1894,-10.3,0.0,0.0,0.0,Autumn,No Holiday,Yes
8756,30/11/2018,764,20,3.4,37,2.3,2000,-9.9,0.0,0.0,0.0,Autumn,No Holiday,Yes
8757,30/11/2018,694,21,2.6,39,0.3,1968,-9.9,0.0,0.0,0.0,Autumn,No Holiday,Yes
8758,30/11/2018,712,22,2.1,41,1.0,1859,-9.8,0.0,0.0,0.0,Autumn,No Holiday,Yes
8759,30/11/2018,584,23,1.9,43,1.3,1909,-9.3,0.0,0.0,0.0,Autumn,No Holiday,Yes

In [31]:
df_kaggle[df_kaggle['Date'] == '01/01/2018']['Rented Bike Count'].

4290

#### 1.1.2 결측치 확인하기

In [7]:
df_kaggle.isnull().sum()

Date                        0
Rented Bike Count           0
Hour                        0
Temperature(캜)              0
Humidity(%)                 0
Wind speed (m/s)            0
Visibility (10m)            0
Dew point temperature(캜)    0
Solar Radiation (MJ/m2)     0
Rainfall(mm)                0
Snowfall (cm)               0
Seasons                     0
Holiday                     0
Functioning Day             0
dtype: int64

#### 1.1.3 컬럼명 확인하기

In [8]:
df_kaggle.columns

Index(['Date', 'Rented Bike Count', 'Hour', 'Temperature(캜)', 'Humidity(%)',
       'Wind speed (m/s)', 'Visibility (10m)', 'Dew point temperature(캜)',
       'Solar Radiation (MJ/m2)', 'Rainfall(mm)', 'Snowfall (cm)', 'Seasons',
       'Holiday', 'Functioning Day'],
      dtype='object')

### 1.2 공공자전거 대여건수 데이터(열린데이터)

#### 1.2.1 데이터 불러오기

##### 23.01 ~ 23.06

In [11]:
df_day_rental1 = pd.read_csv('../data/서울특별시 공공자전거 일별 대여건수_23.1-6.csv', encoding='cp949')
df_day_rental1

           대여일시       대여건수  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0    2023-01-01    38,037          NaN         NaN         NaN         NaN
1    2023-01-02    56,609          NaN         NaN         NaN         NaN
2    2023-01-03    61,252          NaN         NaN         NaN         NaN
3    2023-01-04    67,721          NaN         NaN         NaN         NaN
4    2023-01-05    68,711          NaN         NaN         NaN         NaN
..          ...        ...         ...         ...         ...         ...
175  2023-06-25   133,566          NaN         NaN         NaN         NaN
176  2023-06-27   179,792          NaN         NaN         NaN         NaN
177  2023-06-28   185,929          NaN         NaN         NaN         NaN
178  2023-06-29    35,326          NaN         NaN         NaN         NaN
179  2023-06-30   155,252          NaN         NaN         NaN         NaN

[180 rows x 6 columns]

##### 22.07 ~ 22.12

In [19]:
df_day_rental2 = pd.read_csv('../data/서울특별시 공공자전거 일별 대여건수_22.07-22.12.csv', encoding='cp949')
df_day_rental2 = df_day_rental2[:184]

In [20]:
df_day_rental2

           대여일시       대여건수  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0    2022-07-01   157,478          NaN         NaN         NaN         NaN
1    2022-07-02   131,815          NaN         NaN         NaN         NaN
2    2022-07-03   114,470          NaN         NaN         NaN         NaN
3    2022-07-04   151,497          NaN         NaN         NaN         NaN
4    2022-07-05   149,259          NaN         NaN         NaN         NaN
..          ...        ...         ...         ...         ...         ...
179  2022-12-27    58,890          NaN         NaN         NaN         NaN
180  2022-12-28    54,012          NaN         NaN         NaN         NaN
181  2022-12-29    57,393          NaN         NaN         NaN         NaN
182  2022-12-30    56,058          NaN         NaN         NaN         NaN
183  2022-12-31    42,347          NaN         NaN         NaN         NaN

[184 rows x 6 columns]

##### 22.01 ~ 22.06

In [24]:
df_day_rental3 = pd.read_csv('../data/서울특별시 공공자전거 일별 대여건수_22.01-22.06.csv', encoding='cp949')
df_day_rental3 = df_day_rental3[:181]

In [25]:
df_day_rental3

           대여일시       대여건수  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0    2022-01-01    29,185          NaN         NaN         NaN         NaN
1    2022-01-02    28,914          NaN         NaN         NaN         NaN
2    2022-01-03    53,573          NaN         NaN         NaN         NaN
3    2022-01-04    56,344          NaN         NaN         NaN         NaN
4    2022-01-05    57,413          NaN         NaN         NaN         NaN
..          ...        ...         ...         ...         ...         ...
176  2022-06-26   122,474          NaN         NaN         NaN         NaN
177  2022-06-27    94,761          NaN         NaN         NaN         NaN
178  2022-06-28   112,003          NaN         NaN         NaN         NaN
179  2022-06-29    52,664          NaN         NaN         NaN         NaN
180  2022-06-30     8,796          NaN         NaN         NaN         NaN

[181 rows x 6 columns]

### 1.3 공공자전거 대여소 정보 데이터(열린데이터)

#### 1.3.1 데이터 불러오기

In [33]:
df_rental_shop = pd.read_csv('../data/공공자전거 대여소 정보(23.06월 기준).csv', encoding='cp949')
df_rental_shop

대여소\n번호           4
보관소(대여소)명         4
소재지(위치)           3
Unnamed: 3        3
Unnamed: 4        3
Unnamed: 5        3
설치\n시기            4
설치형태           1436
Unnamed: 8     1169
운영\n방식            4
Unnamed: 10    2753
Unnamed: 11    2753
Unnamed: 12    2753
Unnamed: 13    2753
Unnamed: 14    2753
Unnamed: 15    2753
Unnamed: 16    2753
Unnamed: 17    2753
Unnamed: 18    2753
Unnamed: 19    2753
Unnamed: 20    2753
dtype: int64